<h1 style="color:#1f77b4; text-align:left; font-size:40px;">
    Data Loading
</h1>

<h3 style="color:#555; text-align:left;">
    Data Aquisiton, Dataset join
</h3>


<h2 style="color:#1f77b4; border-bottom: 3px solid #1f77b4; padding-bottom:4px;">
</h2>

<!-- MODELO: Secção principal numerada -->
<!-- 
<h2 style="background-color:#1f77b4; color:white; padding:10px; border-radius:6px;">
    X. Nome da Secção
</h2>
-->

<!-- MODELO: Secção com linha colorida -->
<!-- 
<h2 style="color:#ff7f0e; border-bottom: 3px solid #ff7f0e; padding-bottom:4px;">
    X. Nome da Secção
</h2>
-->

<!-- MODELO: Subsecção -->
<!-- 
<h3 style="color:#2ca02c; margin-top:10px;">
    X.Y Nome da Subsecção
</h3>
-->

<!-- MODELO: Caixa de Nota -->
<!-- 
<div style="border-left: 5px solid #1f77b4; padding:10px; background-color:#f5f9ff; margin:15px 0;">
    <b>Nota:</b> Texto da nota.
</div>
-->

# 1: Dataset Aquisition

1. Importing the libraries/functions:

In [2]:
import pandas as pd
import openpyxl
import os, re
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sys

2. Paths and names of the files

In [4]:
DATA_DIR = os.path.join("..", "data/raw")

FILES = {
    "demographics": "Telco_customer_churn_demographics.xlsx",
    "location":     "Telco_customer_churn_location.xlsx",
    "population":   "Telco_customer_churn_population.xlsx",
    "services":     "Telco_customer_churn_services.xlsx",
    "status":       "Telco_customer_churn_status.xlsx",
}

dfs = {name: pd.read_excel(os.path.join(DATA_DIR, fname)) for name, fname in FILES.items()}

In [5]:
demographics = dfs["demographics"]
location = dfs["location"]
population = dfs["population"]
services = dfs["services"]
status = dfs["status"]

3. Read of the files and normalization of 'CostumerID'

In [ ]:
dfs = {}

for name, fname in FILES.items():
    path = os.path.join(DATA_DIR, fname)
    df = pd.read_excel(path)

    ##normalize column names
    df.columns = [re.sub(r"\s+", " ", c).strip() for c in df.columns]

    # normalize CustomerID
    if "CustomerID" in df.columns:
        df["CustomerID"] = df["CustomerID"].astype(str).str.strip()

    dfs[name] = df
    print(f"{name}: {df.shape}")

demographics: (7043, 9)
location: (7043, 9)
population: (1671, 3)
services: (7043, 30)
status: (7043, 11)

# 2: Dataset joins

Running a quick summary of each table (type of data, nulls, min/max, samples) to identify potential dataset joins

In [ ]:
for name, df in dfs.items():
    print(f"\n{'='*30} {name.upper()} {'='*30}")
    print(f"Shape: {df.shape[0]} lines × {df.shape[1]} columns")
    print("\n Data types and general summary:")
    display(df.info())
    
    #count of nulls and percentage
    print("\nMissing values:")
    missing = df.isna().sum().to_frame("n_missing")
    missing["pct_missing"] = (missing["n_missing"] / len(df) * 100).round(2)
    display(missing[missing["n_missing"] > 0].sort_values("pct_missing", ascending=False))
    
    #uniqu values, min, max
    print("\nColumn summary:")
    summary = pd.DataFrame({
        "dtype": df.dtypes,
        "n_unique": df.nunique(),
        "n_missing": df.isna().sum(),
    })
    
    #for numeric columns: add min and max
    numeric_cols = df.select_dtypes(include=np.number).columns
    summary.loc[numeric_cols, "min"] = df[numeric_cols].min()
    summary.loc[numeric_cols, "max"] = df[numeric_cols].max()
    
    display(summary)
    
     #quick look at some rows
    print("\nSample:")
    display(df.head(3))
    
    print("-" * 80)

============================== DEMOGRAPHICS ==============================
Shape: 7043 lines × 9 columns

 Data types and general summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Customer ID           7043 non-null   object
 1   Count                 7043 non-null   int64
 2   Gender                7043 non-null   object
 3   Age                   7043 non-null   int64
 4   Under 30              7043 non-null   object
 5   Senior Citizen        7043 non-null   object
 6   Married               7043 non-null   object
 7   Dependents            7043 non-null   object
 8   Number of Dependents  7043 non-null   int64
dtypes: int64(3), object(6)
memory usage: 495.3+ KB

None

Missing values:

Empty DataFrame
Columns: [n_missing, pct_missing]
Index: []

Column summary:

                       dtype  n_unique  n_missing   min   max
Customer ID           object      7043          0   NaN   NaN
Count                  int64         1          0   1.0   1.0
Gender                object         2          0   NaN   NaN
Age                    int64        62          0  19.0  80.0
Under 30              object         2          0   NaN   NaN
Senior Citizen        object         2          0   NaN   NaN
Married               object         2          0   NaN   NaN
Dependents            object         2          0   NaN   NaN
Number of Dependents   int64        10          0   0.0   9.0

Sample:

,Customer ID,Count,Gender,Age,Under 30,Senior Citizen,Married,Dependents,Number of Dependents
0,8779-QRDMV,1,Male,78,No,Yes,No,No,0
1,7495-OOKFY,1,Female,74,No,Yes,Yes,Yes,1
2,1658-BYGOY,1,Male,71,No,Yes,No,Yes,3

--------------------------------------------------------------------------------

============================== LOCATION ==============================
Shape: 7043 lines × 9 columns

 Data types and general summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Customer ID  7043 non-null   object
 1   Count        7043 non-null   int64
 2   Country      7043 non-null   object
 3   State        7043 non-null   object
 4   City         7043 non-null   object
 5   Zip Code     7043 non-null   int64
 6   Lat Long     7043 non-null   object
 7   Latitude     7043 non-null   float64
 8   Longitude    7043 non-null   float64
dtypes: float64(2), int64(2), object(5)
memory usage: 495.3+ KB

None

Missing values:

Empty DataFrame
Columns: [n_missing, pct_missing]
Index: []

Column summary:

               dtype  n_unique  n_missing           min           max
Customer ID   object      7043          0           NaN           NaN
Count          int64         1          0      1.000000      1.000000
Country       object         1          0           NaN           NaN
State         object         1          0           NaN           NaN
City          object      1106          0           NaN           NaN
Zip Code       int64      1626          0  90001.000000  96150.000000
Lat Long      object      1679          0           NaN           NaN
Latitude     float64      1626          0     32.555828     41.962127
Longitude    float64      1625          0   -124.301372   -114.192901

Sample:

,Customer ID,Count,Country,State,City,Zip Code,Lat Long,Latitude,Longitude
0,8779-QRDMV,1,United States,California,Los Angeles,90022,"34.02381, -118.156582",34.023810,-118.156582
1,7495-OOKFY,1,United States,California,Los Angeles,90063,"34.044271, -118.185237",34.044271,-118.185237
2,1658-BYGOY,1,United States,California,Los Angeles,90065,"34.108833, -118.229715",34.108833,-118.229715

--------------------------------------------------------------------------------

============================== POPULATION ==============================
Shape: 1671 lines × 3 columns

 Data types and general summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1671 entries, 0 to 1670
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          1671 non-null   int64
 1   Zip Code    1671 non-null   int64
 2   Population  1671 non-null   int64
dtypes: int64(3)
memory usage: 39.3 KB

None

Missing values:

Empty DataFrame
Columns: [n_missing, pct_missing]
Index: []

Column summary:

            dtype  n_unique  n_missing      min       max
ID          int64      1671          0      1.0    1671.0
Zip Code    int64      1671          0  90001.0   96161.0
Population  int64      1607          0     11.0  105285.0

Sample:

   ID  Zip Code  Population
0   1     90001       54492
1   2     90002       44586
2   3     90003       58198

--------------------------------------------------------------------------------

============================== SERVICES ==============================
Shape: 7043 lines × 30 columns

 Data types and general summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 30 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Customer ID                        7043 non-null   object
 1   Count                              7043 non-null   int64
 2   Quarter                            7043 non-null   object
 3   Referred a Friend                  7043 non-null   object
 4   Number of Referrals                7043 non-null   int64
 5   Tenure in Months                   7043 non-null   int64
 6   Offer                              3166 non-null   object
 7   Phone Service                      7043 non-null   object
 8   Avg Monthly Long Distance Charges  7043 non-null   float64
 9   Multiple Lines                     7043 non-null   object
 10  Internet Service                   7043 non-null   object
 11  Internet Type                      5517 non-null   object
 12  Avg Monthly GB Download            7043 non-null   int64
 13  Online Security                    7043 non-null   object
 14  Online Backup                      7043 non-null   object
 15  Device Protection Plan             7043 non-null   object
 16  Premium Tech Support               7043 non-null   object
 17  Streaming TV                       7043 non-null   object
 18  Streaming Movies                   7043 non-null   object
 19  Streaming Music                    7043 non-null   object
 20  Unlimited Data                     7043 non-null   object
 21  Contract                           7043 non-null   object
 22  Paperless Billing                  7043 non-null   object
 23  Payment Method                     7043 non-null   object
 24  Monthly Charge                     7043 non-null   float64
 25  Total Charges                      7043 non-null   float64
 26  Total Refunds                      7043 non-null   float64
 27  Total Extra Data Charges           7043 non-null   int64
 28  Total Long Distance Charges        7043 non-null   float64
 29  Total Revenue                      7043 non-null   float64
dtypes: float64(6), int64(5), object(19)
memory usage: 1.6+ MB

None

Missing values:

               n_missing  pct_missing
Offer               3877        55.05
Internet Type       1526        21.67

Column summary:

,dtype,n_unique,n_missing,min,max
Customer ID,object,7043,0,NaN,NaN
Count,int64,1,0,1.00,1.00
Quarter,object,1,0,NaN,NaN
Referred a Friend,object,2,0,NaN,NaN
Number of Referrals,int64,12,0,0.00,11.00
Tenure in Months,int64,72,0,1.00,72.00
Offer,object,5,3877,NaN,NaN
Phone Service,object,2,0,NaN,NaN
Avg Monthly Long Distance Charges,float64,3584,0,0.00,49.99
Multiple Lines,object,2,0,NaN,NaN
Internet Service,object,2,0,NaN,NaN
Internet Type,object,3,1526,NaN,NaN
Avg Monthly GB Download,int64,50,0,0.00,85.00
Online Security,object,2,0,NaN,NaN
Online Backup,object,2,0,NaN,NaN
Device Protection Plan,object,2,0,NaN,NaN
Premium Tech Support,object,2,0,NaN,NaN
Streaming TV,object,2,0,NaN,NaN
Streaming Movies,object,2,0,NaN,NaN
Streaming Music,object,2,0,NaN,NaN
Unlimited Data,object,2,0,NaN,NaN
Contract,object,3,0,NaN,NaN
Paperless Billing,object,2,0,NaN,NaN
Payment Method,object,3,0,NaN,NaN
Monthly Charge,float64,1585,0,18.25,118.75
Total Charges,float64,6540,0,18.80,8684.80
Total Refunds,float64,500,0,0.00,49.79
Total Extra Data Charges,int64,16,0,0.00,150.00
Total Long Distance Charges,float64,6110,0,0.00,3564.72
Total Revenue,float64,6996,0,21.36,11979.34

Sample:

,Customer ID,Count,Quarter,Referred a Friend,Number of Referrals,Tenure in Months,Offer,Phone Service,Avg Monthly Long Distance Charges,Multiple Lines,...,Unlimited Data,Contract,Paperless Billing,Payment Method,Monthly Charge,Total Charges,Total Refunds,Total Extra Data Charges,Total Long Distance Charges,Total Revenue
0,8779-QRDMV,1,Q3,No,0,1,NaN,No,0.00,No,...,No,Month-to-Month,Yes,Bank Withdrawal,39.65,39.65,0.00,20,0.00,59.65
1,7495-OOKFY,1,Q3,Yes,1,8,Offer E,Yes,48.85,Yes,...,Yes,Month-to-Month,Yes,Credit Card,80.65,633.30,0.00,0,390.80,1024.10
2,1658-BYGOY,1,Q3,No,0,18,Offer D,Yes,11.33,Yes,...,Yes,Month-to-Month,Yes,Bank Withdrawal,95.45,1752.55,45.61,0,203.94,1910.88

--------------------------------------------------------------------------------

============================== STATUS ==============================
Shape: 7043 lines × 11 columns

 Data types and general summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         7043 non-null   object
 1   Count               7043 non-null   int64
 2   Quarter             7043 non-null   object
 3   Satisfaction Score  7043 non-null   int64
 4   Customer Status     7043 non-null   object
 5   Churn Label         7043 non-null   object
 6   Churn Value         7043 non-null   int64
 7   Churn Score         7043 non-null   int64
 8   CLTV                7043 non-null   int64
 9   Churn Category      1869 non-null   object
 10  Churn Reason        1869 non-null   object
dtypes: int64(5), object(6)
memory usage: 605.4+ KB

None

Missing values:

                n_missing  pct_missing
Churn Category       5174        73.46
Churn Reason         5174        73.46

Column summary:

                     dtype  n_unique  n_missing     min     max
Customer ID         object      7043          0     NaN     NaN
Count                int64         1          0     1.0     1.0
Quarter             object         1          0     NaN     NaN
Satisfaction Score   int64         5          0     1.0     5.0
Customer Status     object         3          0     NaN     NaN
Churn Label         object         2          0     NaN     NaN
Churn Value          int64         2          0     0.0     1.0
Churn Score          int64        81          0     5.0    96.0
CLTV                 int64      3438          0  2003.0  6500.0
Churn Category      object         5       5174     NaN     NaN
Churn Reason        object        20       5174     NaN     NaN

Sample:

,Customer ID,Count,Quarter,Satisfaction Score,Customer Status,Churn Label,Churn Value,Churn Score,CLTV,Churn Category,Churn Reason
0,8779-QRDMV,1,Q3,3,Churned,Yes,1,91,5433,Competitor,Competitor offered more data
1,7495-OOKFY,1,Q3,3,Churned,Yes,1,69,5302,Competitor,Competitor made better offer
2,1658-BYGOY,1,Q3,2,Churned,Yes,1,81,3179,Competitor,Competitor made better offer

--------------------------------------------------------------------------------

Some conclusions were taken and already added into the next notebook called - 002_EDA

It was also identified the possibility of having a union on the datasets based on the Customer ID. Let's do it, step by step:
1. cleaning blank spaces on the column names (to avoid duplicating collumns)
2. check which columns collide before merging them
3. normalize the customer ID
4. merge the tables

In [7]:
##Clean blank spaces on the column names

for df in [demographics, location, services, status]:
    df.columns = (
        df.columns
        .str.strip()               #remove spaces at the beginning and end
        .str.replace(r"\s+", "_", regex=True)  #replace spaces with underscores
        .str.lower()                # transform to lowercase
    )

print(df)

     customer_id  count quarter  satisfaction_score customer_status  \
0     8779-QRDMV      1      Q3                   3         Churned
1     7495-OOKFY      1      Q3                   3         Churned
2     1658-BYGOY      1      Q3                   2         Churned
3     4598-XLKNJ      1      Q3                   2         Churned
4     4846-WHAFZ      1      Q3                   2         Churned
...          ...    ...     ...                 ...             ...
7038  2569-WGERO      1      Q3                   5          Stayed
7039  6840-RESVB      1      Q3                   3          Stayed
7040  2234-XADUH      1      Q3                   4          Stayed
7041  4801-JZAZL      1      Q3                   4          Stayed
7042  3186-AJIEK      1      Q3                   4          Stayed

     churn_label  churn_value  churn_score  cltv   churn_category  \
0            Yes            1           91  5433       Competitor
1            Yes            1           69  5302       Competitor
2            Yes            1           81  3179       Competitor
3            Yes            1           88  5337  Dissatisfaction
4            Yes            1           67  2793            Price
...          ...          ...          ...   ...              ...
7038          No            0           45  5306              NaN
7039          No            0           59  2140              NaN
7040          No            0           71  5560              NaN
7041          No            0           59  2793              NaN
7042          No            0           38  5097              NaN

                      churn_reason
0     Competitor offered more data
1     Competitor made better offer
2     Competitor made better offer
3        Limited range of services
4               Extra data charges
...                            ...
7038                           NaN
7039                           NaN
7040                           NaN
7041                           NaN
7042                           NaN

[7043 rows x 11 columns]

In [8]:
#check which columns collide before merging them

def overlapping_cols(a, b, key="customer_id"):
    return sorted((set(a.columns) & set(b.columns)) - {key})

print("demo vs loc:", overlapping_cols(demographics, location))
print("demo+loc vs svc:", overlapping_cols(
      demographics.merge(location, on="customer_id", how="inner"), services))
print("… vs status:", overlapping_cols(
      demographics.merge(location, on="customer_id", how="inner")
                  .merge(services, on="customer_id", how="inner"), status))

demo vs loc: ['count']
demo+loc vs svc: []
… vs status: ['count', 'quarter']

In [9]:
#normalize the Customer ID

KEY = "customer_id"  # already normalized to lower/underscore

def add_prefix_except(df: pd.DataFrame, prefix: str, keep=(KEY,)) -> pd.DataFrame:
    return df.rename(columns={c: (prefix + c) if c not in keep else c for c in df.columns})

# normalize function to standardize column names and customer_id
def normalize(df):
    out = df.copy()
    out.columns = (out.columns
                   .str.strip()
                   .str.replace(r"\s+", "_", regex=True)
                   .str.lower())
    for cand in ("customer_id","customerid","customer_id_","customer_id1","customer id"):
        if cand in out.columns and cand != KEY:
            out = out.rename(columns={cand: KEY})
    out[KEY] = out[KEY].astype(str).str.strip()
    return out

demographics = normalize(demographics)
location     = normalize(location)
services     = normalize(services)
status       = normalize(status)

# prefixes to avoid collisions
demo_ = add_prefix_except(demographics, "demo_")
loc_  = add_prefix_except(location,     "loc_")
svc_  = add_prefix_except(services,     "svc_")
st_   = add_prefix_except(status,       "st_")

# safe merge (one_to_one guarantees no duplicate keys)
df_master = (demo_
             .merge(loc_, on=KEY, how="inner", validate="one_to_one")
             .merge(svc_, on=KEY, how="inner", validate="one_to_one")
             .merge(st_,  on=KEY, how="inner", validate="one_to_one")
            ).set_index(KEY)

print(df_master.shape)
df_master.head()
df_master.info()

(7043, 55)
<class 'pandas.core.frame.DataFrame'>
Index: 7043 entries, 8779-QRDMV to 3186-AJIEK
Data columns (total 55 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   demo_count                             7043 non-null   int64
 1   demo_gender                            7043 non-null   object
 2   demo_age                               7043 non-null   int64
 3   demo_under_30                          7043 non-null   object
 4   demo_senior_citizen                    7043 non-null   object
 5   demo_married                           7043 non-null   object
 6   demo_dependents                        7043 non-null   object
 7   demo_number_of_dependents              7043 non-null   int64
 8   loc_count                              7043 non-null   int64
 9   loc_country                            7043 non-null   object
 10  loc_state                              7043 non-null   object
 11  loc_city                               7043 non-null   object
 12  loc_zip_code                           7043 non-null   int64
 13  loc_lat_long                           7043 non-null   object
 14  loc_latitude                           7043 non-null   float64
 15  loc_longitude                          7043 non-null   float64
 16  svc_count                              7043 non-null   int64
 17  svc_quarter                            7043 non-null   object
 18  svc_referred_a_friend                  7043 non-null   object
 19  svc_number_of_referrals                7043 non-null   int64
 20  svc_tenure_in_months                   7043 non-null   int64
 21  svc_offer                              3166 non-null   object
 22  svc_phone_service                      7043 non-null   object
 23  svc_avg_monthly_long_distance_charges  7043 non-null   float64
 24  svc_multiple_lines                     7043 non-null   object
 25  svc_internet_service                   7043 non-null   object
 26  svc_internet_type                      5517 non-null   object
 27  svc_avg_monthly_gb_download            7043 non-null   int64
 28  svc_online_security                    7043 non-null   object
 29  svc_online_backup                      7043 non-null   object
 30  svc_device_protection_plan             7043 non-null   object
 31  svc_premium_tech_support               7043 non-null   object
 32  svc_streaming_tv                       7043 non-null   object
 33  svc_streaming_movies                   7043 non-null   object
 34  svc_streaming_music                    7043 non-null   object
 35  svc_unlimited_data                     7043 non-null   object
 36  svc_contract                           7043 non-null   object
 37  svc_paperless_billing                  7043 non-null   object
 38  svc_payment_method                     7043 non-null   object
 39  svc_monthly_charge                     7043 non-null   float64
 40  svc_total_charges                      7043 non-null   float64
 41  svc_total_refunds                      7043 non-null   float64
 42  svc_total_extra_data_charges           7043 non-null   int64
 43  svc_total_long_distance_charges        7043 non-null   float64
 44  svc_total_revenue                      7043 non-null   float64
 45  st_count                               7043 non-null   int64
 46  st_quarter                             7043 non-null   object
 47  st_satisfaction_score                  7043 non-null   int64
 48  st_customer_status                     7043 non-null   object
 49  st_churn_label                         7043 non-null   object
 50  st_churn_value                         7043 non-null   int64
 51  st_churn_score                         7043 non-null   int64
 52  st_cltv                                7043 non-null   int64
 53  st_churn_category                      1869 non-null   object
 54  st_churn_reason                        1869 non-null   object
dtypes: float64(8), int64(15), object(32)
memory usage: 3.0+ MB

Running some sanity checks:
1. Asserts to prevent broken merfes and ensure data integrity (every customer only appears once and there are no NaN customers)
2. 
✔ prevent broken merges
✔ ensure data integrity
✔ protect model training from silent errors
The column filters:
✔ confirm engineered features exist
✔ help inspect feature naming
✔ validate preprocessing steps